# Projet 5 :  Automatiser les rapports de ventes avec SQL

##  Problématique métier
 Une entreprise souhaite produire un rapport détaillant les ventes
 totales par produit pour le dernier trimestre.

## Objectif
 Utiliser SQL pour extraire, filtrer et agréger les données nécessaires.

## Chargement des bibliothéques

In [ ]:
import psycopg2
import pandas as pd

## Connexion à la base de données sur postgres en local

In [ ]:
# Conectar a la base de datos
conexion = psycopg2.connect(
    host="localhost",
    database="chinook",
    user="postgres",
    password="mdrs050796",
    port=5432
)
cursor = conexion.cursor()

##  Requêtes de base

1. **Clients non américains** : Fournissez une requête affichant les Clients (leurs noms complets, ID client et pays) qui ne sont pas aux
 États-Unis.

In [597]:
df_1 = pd.read_sql_query("SELECT customer_id, first_name ||' '|| last_name AS NomCompletClient, country FROM customer WHERE country<>'USA'", conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\4007774957.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_1 = pd.read_sql_query("SELECT customer_id, first_name ||' '|| last_name AS NomCompletClient, country FROM customer WHERE country<>'USA'", conexion)

In [599]:
df_1.head(5)

   customer_id       nomcompletclient         country
0            1         Luís Gonçalves          Brazil
1            2          Leonie Köhler         Germany
2            3      François Tremblay          Canada
3            4           Bjørn Hansen          Norway
4            5  František Wichterlová  Czech Republic

In [601]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       46 non-null     int64
 1   nomcompletclient  46 non-null     object
 2   country           46 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.2+ KB

 2.  **Clients brésiliens** : Fournissez une requête affichant uniquement
 les Clients provenant du Brésil.

In [604]:
df_2 = pd.read_sql_query("SELECT * FROM customer WHERE country='Brazil'", conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\4094062559.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2 = pd.read_sql_query("SELECT * FROM customer WHERE country='Brazil'", conexion)

In [606]:
df_2.head(5)

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

In [608]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     5 non-null      int64
 1   first_name      5 non-null      object
 2   last_name       5 non-null      object
 3   company         4 non-null      object
 4   address         5 non-null      object
 5   city            5 non-null      object
 6   state           5 non-null      object
 7   country         5 non-null      object
 8   postal_code     5 non-null      object
 9   phone           5 non-null      object
 10  fax             5 non-null      object
 11  email           5 non-null      object
 12  support_rep_id  5 non-null      int64
dtypes: int64(2), object(11)
memory usage: 652.0+ bytes

3. **Factures des clients brésiliens** : Fournissez une requête affichant
 les factures des clients qui sont du Brésil.
 Le tableau résultant doit inclure le nom complet du client, l'ID de la
 facture, la date de la facture et le pays de facturation.

In [611]:
df_3 = pd.read_sql_query("SELECT c.first_name ||' '|| c.last_name AS NomCompletClient, i.invoice_Id AS ID_Facture, i.invoice_date AS Date_Facture,i.billing_country AS Pays_Facturation FROM Invoice i JOIN customer c ON i.customer_Id = c.customer_Id ORDER BY i.invoice_date DESC"
                            , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2804416285.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3 = pd.read_sql_query("SELECT c.first_name ||' '|| c.last_name AS NomCompletClient, i.invoice_Id AS ID_Facture, i.invoice_date AS Date_Facture,i.billing_country AS Pays_Facturation FROM Invoice i JOIN customer c ON i.customer_Id = c.customer_Id ORDER BY i.invoice_date DESC"

In [613]:
df_3.head(5)

   nomcompletclient  id_facture date_facture pays_facturation
0      Manoj Pareek         412   2025-12-22            India
1  Terhi Hämäläinen         411   2025-12-14          Finland
2  Madalena Sampaio         410   2025-12-09         Portugal
3      Robert Brown         409   2025-12-06           Canada
4    Victor Stevens         408   2025-12-05              USA

In [615]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   nomcompletclient  412 non-null    object
 1   id_facture        412 non-null    int64
 2   date_facture      412 non-null    datetime64[ns]
 3   pays_facturation  412 non-null    object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 13.0+ KB

4. **Agents de vente** : Fournissez une requête affichant uniquement
 les employés qui sont des Agents de Vente

In [618]:
df_4 = pd.read_sql_query("SELECT * FROM employee WHERE title='Sales Support Agent'", conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\3135535805.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4 = pd.read_sql_query("SELECT * FROM employee WHERE title='Sales Support Agent'", conexion)

In [620]:
df_4.head(5)

,employee_id,last_name,first_name,title,reports_to,birth_date,hire_date,address,city,state,country,postal_code,phone,fax,email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29,2002-04-01,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19,2003-05-03,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03,2003-10-17,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [622]:
df_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  3 non-null      int64
 1   last_name    3 non-null      object
 2   first_name   3 non-null      object
 3   title        3 non-null      object
 4   reports_to   3 non-null      int64
 5   birth_date   3 non-null      datetime64[ns]
 6   hire_date    3 non-null      datetime64[ns]
 7   address      3 non-null      object
 8   city         3 non-null      object
 9   state        3 non-null      object
 10  country      3 non-null      object
 11  postal_code  3 non-null      object
 12  phone        3 non-null      object
 13  fax          3 non-null      object
 14  email        3 non-null      object
dtypes: datetime64[ns](2), int64(2), object(11)
memory usage: 492.0+ bytes

##  Agrégations et relations

 5. **Pays uniques dans les factures** : Fournissez une requête affichant
 une liste unique des pays de facturation présents dans la table Invoice.

In [626]:
df_5 = pd.read_sql_query("SELECT DISTINCT billing_country FROM Invoice", conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2340603061.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5 = pd.read_sql_query("SELECT DISTINCT billing_country FROM Invoice", conexion)

In [628]:
df_5

   billing_country
0        Argentina
1            Spain
2            Italy
3          Hungary
4            India
5   Czech Republic
6          Belgium
7           Sweden
8            Chile
9           Norway
10          France
11             USA
12  United Kingdom
13     Netherlands
14          Brazil
15         Austria
16          Poland
17       Australia
18         Ireland
19         Germany
20         Denmark
21          Canada
22         Finland
23        Portugal

6. **Factures par agent de vente** : Fournissez une requête affichant les
 factures associées à chaque agent de vente.
 Le tableau résultant doit inclure le nom complet de l'agent de
 vente.

In [631]:
df_6 = pd.read_sql_query("SELECT e.first_name || ' ' || e.last_name AS NomCompletAgent, i.invoice_Id AS ID_Facture, i.invoice_date AS Date_Facture, i.total AS Montant_Total FROM Invoice i JOIN Customer c ON i.customer_Id = c.customer_Id JOIN Employee e ON c.support_rep_Id = e.employee_Id WHERE e.title LIKE '%Sales%Agent%' ORDER BY NomCompletAgent, i.invoice_date DESC"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2370649312.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6 = pd.read_sql_query("SELECT e.first_name || ' ' || e.last_name AS NomCompletAgent, i.invoice_Id AS ID_Facture, i.invoice_date AS Date_Facture, i.total AS Montant_Total FROM Invoice i JOIN Customer c ON i.customer_Id = c.customer_Id JOIN Employee e ON c.support_rep_Id = e.employee_Id WHERE e.title LIKE '%Sales%Agent%' ORDER BY NomCompletAgent, i.invoice_date DESC"

In [633]:
df_6.head()

  nomcompletagent  id_facture date_facture  montant_total
0    Jane Peacock         412   2025-12-22           1.99
1    Jane Peacock         411   2025-12-14          13.86
2    Jane Peacock         409   2025-12-06           5.94
3    Jane Peacock         401   2025-11-04           3.96
4    Jane Peacock         400   2025-11-03           1.98

In [635]:
df_6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nomcompletagent  412 non-null    object
 1   id_facture       412 non-null    int64
 2   date_facture     412 non-null    datetime64[ns]
 3   montant_total    412 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 13.0+ KB

7. **Détails des factures** : Fournissez une requête affichant le total de
 chaque facture, le nom du client, le pays et le nom de l'agent de vente.

In [638]:
df_7 = pd.read_sql_query("SELECT i.total AS Montant_Total, c.first_name || ' ' || c.last_name AS NomCompletClient, e.country AS PaysAgent, e.first_name || ' ' || e.last_name AS NomCompletAgent FROM Invoice i JOIN Customer c ON i.customer_Id = c.customer_Id JOIN Employee e ON c.support_rep_Id = e.employee_Id WHERE e.title LIKE '%Sales%Agent%' ORDER BY NomCompletClient ASC"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\475635780.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7 = pd.read_sql_query("SELECT i.total AS Montant_Total, c.first_name || ' ' || c.last_name AS NomCompletClient, e.country AS PaysAgent, e.first_name || ' ' || e.last_name AS NomCompletAgent FROM Invoice i JOIN Customer c ON i.customer_Id = c.customer_Id JOIN Employee e ON c.support_rep_Id = e.employee_Id WHERE e.title LIKE '%Sales%Agent%' ORDER BY NomCompletClient ASC"

In [640]:
df_7.head()

   montant_total nomcompletclient paysagent nomcompletagent
0           0.99   Aaron Mitchell    Canada   Margaret Park
1           1.98   Aaron Mitchell    Canada   Margaret Park
2          13.86   Aaron Mitchell    Canada   Margaret Park
3           8.91   Aaron Mitchell    Canada   Margaret Park
4           1.98   Aaron Mitchell    Canada   Margaret Park

In [642]:
df_7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   montant_total     412 non-null    float64
 1   nomcompletclient  412 non-null    object
 2   paysagent         412 non-null    object
 3   nomcompletagent   412 non-null    object
dtypes: float64(1), object(3)
memory usage: 13.0+ KB

## Analyse par année et lignes de facture

 8. **Ventes par année** : Combien de factures y a-t-il eu en 2009 et
 2011 ? Quels sont les montants totaux des ventes pour chacune de
 ces années ?

In [646]:
df_8 = pd.read_sql_query("SELECT COUNT(*) AS nombredefactures FROM Invoice WHERE DATE_PART('year', invoice_date)=2009 AND DATE_PART('year', invoice_date)=2011"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\3136455220.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_8 = pd.read_sql_query("SELECT COUNT(*) AS nombredefactures FROM Invoice WHERE DATE_PART('year', invoice_date)=2009 AND DATE_PART('year', invoice_date)=2011"

In [648]:
df_8

   nombredefactures
0                 0

9. **Articles pour une facture donnée** : Fournissez une requête
 comptant le nombre d'articles (line items) pour l'ID de facture 37.

In [651]:
df_9 = pd.read_sql_query("SELECT COUNT(*) AS nombre_article FROM Invoice_Line WHERE invoice_id=37"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\1133726734.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_9 = pd.read_sql_query("SELECT COUNT(*) AS nombre_article FROM Invoice_Line WHERE invoice_id=37"

In [653]:
df_9

   nombre_article
0               4

 10. **Articles par facture** : Fournissez une requête comptant le nombre
 d'articles (line items) pour chaque facture.

In [656]:
df_10 = pd.read_sql_query("SELECT invoice_id AS id_facture, COUNT(*) AS nombre_article FROM Invoice_Line GROUP BY invoice_id"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2128938581.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_10 = pd.read_sql_query("SELECT invoice_id AS id_facture, COUNT(*) AS nombre_article FROM Invoice_Line GROUP BY invoice_id"

In [658]:
df_10

     id_facture  nombre_article
0           384               1
1           351               2
2           184               4
3           116               9
4            87               6
..          ...             ...
407          55               1
408         148               2
409         130               9
410         270               9
411          23               4

[412 rows x 2 columns]

In [660]:
df_10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_facture      412 non-null    int64
 1   nombre_article  412 non-null    int64
dtypes: int64(2)
memory usage: 6.6 KB

## Détails des morceaux

11. **Nom des morceaux** : Fournissez une requête incluant le nom du
 morceau pour chaque ligne de facture.

In [664]:
df_11 = pd.read_sql_query("SELECT T.name AS nom_morceau, il.invoice_line_Id AS invoice_line_id FROM Invoice_Line il JOIN Track T ON il.track_Id = T.track_Id"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\3651656957.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_11 = pd.read_sql_query("SELECT T.name AS nom_morceau, il.invoice_line_Id AS invoice_line_id FROM Invoice_Line il JOIN Track T ON il.track_Id = T.track_Id"

In [666]:
df_11

                                            nom_morceau  invoice_line_id
0                                     Balls to the Wall                1
1                                     Restless and Wild                2
2                                 Put The Finger On You                3
3                                      Inject The Venom                4
4                                            Evil Walks                5
...                                                 ...              ...
2235                                   Looking For Love             2236
2236                                    Sweet Lady Luck             2237
2237  Feirinha da Pavuna/Luz do Repente/Bagaço da La...             2238
2238                                   Samba pras moças             2239
2239                                           Hot Girl             2240

[2240 rows x 2 columns]

In [668]:
df_11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nom_morceau      2240 non-null   object
 1   invoice_line_id  2240 non-null   int64
dtypes: int64(1), object(1)
memory usage: 35.1+ KB

12. **Morceaux et artistes** : Fournissez une requête incluant le nom du
 morceau acheté ET le nom de l'artiste pour chaque ligne de facture.

In [671]:
df_12 = pd.read_sql_query("SELECT T.name AS nom_morceau, il.invoice_line_Id AS invoice_line_id, a.name AS nom_artiste FROM Invoice_Line il JOIN Track T ON il.track_Id = T.track_Id JOIN Album al ON T.album_Id = al.album_Id JOIN Artist a ON  al.artist_Id = a.artist_Id "
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\1219800518.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_12 = pd.read_sql_query("SELECT T.name AS nom_morceau, il.invoice_line_Id AS invoice_line_id, a.name AS nom_artiste FROM Invoice_Line il JOIN Track T ON il.track_Id = T.track_Id JOIN Album al ON T.album_Id = al.album_Id JOIN Artist a ON  al.artist_Id = a.artist_Id "

In [673]:
df_12

,nom_morceau,invoice_line_id,nom_artiste
0,Balls to the Wall,1,Accept
1,Restless and Wild,2,Accept
2,Put The Finger On You,3,AC/DC
3,Inject The Venom,4,AC/DC
4,Evil Walks,5,AC/DC
...,...,...,...
2235,Looking For Love,2236,Lenny Kravitz
2236,Sweet Lady Luck,2237,Lenny Kravitz
2237,Feirinha da Pavuna/Luz do Repente/Bagaço da La...,2238,Zeca Pagodinho
2238,Samba pras moças,2239,Zeca Pagodinho
2239,Hot Girl,2240,The Office

In [675]:
df_12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nom_morceau      2240 non-null   object
 1   invoice_line_id  2240 non-null   int64
 2   nom_artiste      2240 non-null   object
dtypes: int64(1), object(2)
memory usage: 52.6+ KB

 ## Comptages et regroupements

13. **Nombre de factures par pays** : Fournissez une requête affichant
 le nombre de factures par pays.

In [679]:
df_13 = pd.read_sql_query("SELECT billing_country AS country, COUNT(*) AS nombre_facture FROM Invoice GROUP BY billing_country"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\679031892.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_13 = pd.read_sql_query("SELECT billing_country AS country, COUNT(*) AS nombre_facture FROM Invoice GROUP BY billing_country"

In [681]:
df_13

           country  nombre_facture
0        Argentina               7
1            Spain               7
2            Italy               7
3          Hungary               7
4            India              13
5   Czech Republic              14
6          Belgium               7
7           Sweden               7
8            Chile               7
9           Norway               7
10          France              35
11             USA              91
12  United Kingdom              21
13     Netherlands               7
14          Brazil              35
15         Austria               7
16          Poland               7
17       Australia               7
18         Ireland               7
19         Germany              28
20         Denmark               7
21          Canada              56
22         Finland               7
23        Portugal              14

In [683]:
df_13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country         24 non-null     object
 1   nombre_facture  24 non-null     int64
dtypes: int64(1), object(1)
memory usage: 516.0+ bytes

 14. **Nombre de morceaux par playlist** : Fournissez une requête
 affichant le nombre total de morceaux dans chaque playlist.
 Le nom de la playlist doit être inclus dans le tableau résultant.

In [686]:
df_14 = pd.read_sql_query("SELECT pl.name, COUNT(plt.track_Id) AS nombre_morceau FROM Playlist_Track plt JOIN Playlist pl ON  plt.playlist_Id = pl.playlist_Id  GROUP BY pl.name ORDER BY nombre_morceau ASC"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2243717586.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_14 = pd.read_sql_query("SELECT pl.name, COUNT(plt.track_Id) AS nombre_morceau FROM Playlist_Track plt JOIN Playlist pl ON  plt.playlist_Id = pl.playlist_Id  GROUP BY pl.name ORDER BY nombre_morceau ASC"

In [688]:
df_14

                          name  nombre_morceau
0                 Music Videos               1
1                  On-The-Go 1               1
2                       Grunge              15
3   Classical 101 - The Basics              25
4   Classical 101 - Next Steps              25
5    Classical 101 - Deep Cuts              25
6          Heavy Metal Classic              26
7              Brazilian Music              39
8                    Classical              75
9                     TV Shows             426
10                  90’s Music            1477
11                       Music            6580

 15. **Liste des morceaux** : Fournissez une requête affichant tous les
 morceaux (Tracks), mais sans afficher les IDs.
 Le tableau résultant doit inclure le nom de l'album, le type de média
 et le genre.

In [691]:
df_15 = pd.read_sql_query("SELECT t.name AS Morceau, a.title AS Album, mt.name AS TypeMedia, g.name AS Genre FROM Track t JOIN Album a ON t.album_Id = a.album_Id JOIN Media_Type mt ON t.media_type_Id = mt.media_type_Id JOIN Genre g ON t.genre_Id = g.genre_Id ORDER BY  a.title, t.name"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\1785552603.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_15 = pd.read_sql_query("SELECT t.name AS Morceau, a.title AS Album, mt.name AS TypeMedia, g.name AS Genre FROM Track t JOIN Album a ON t.album_Id = a.album_Id JOIN Media_Type mt ON t.media_type_Id = mt.media_type_Id JOIN Genre g ON t.genre_Id = g.genre_Id ORDER BY  a.title, t.name"

In [693]:
df_15

,morceau,album,typemedia,genre
0,...And Justice For All,...And Justice For All,MPEG audio file,Metal
1,Blackened,...And Justice For All,MPEG audio file,Metal
2,Dyers Eve,...And Justice For All,MPEG audio file,Metal
3,Eye Of The Beholder,...And Justice For All,MPEG audio file,Metal
4,Harvester Of Sorrow,...And Justice For All,MPEG audio file,Metal
...,...,...,...,...
3498,Some Days Are Better Than Others,Zooropa,MPEG audio file,Rock
3499,"Stay (Faraway, So Close!)",Zooropa,MPEG audio file,Rock
3500,The First Time,Zooropa,MPEG audio file,Rock
3501,The Wanderer,Zooropa,MPEG audio file,Rock
3502,Zooropa,Zooropa,MPEG audio file,Rock

In [695]:
df_15.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3503 entries, 0 to 3502
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   morceau    3503 non-null   object
 1   album      3503 non-null   object
 2   typemedia  3503 non-null   object
 3   genre      3503 non-null   object
dtypes: object(4)
memory usage: 109.6+ KB

## Analyse des ventes

16. **Factures et articles** : Fournissez une requête affichant toutes les
 factures, avec le nombre d'articles par facture.

In [699]:
df_16 = pd.read_sql_query("SELECT invoice_Id AS id_facture, sum(quantity) AS nombre_article FROM Invoice_Line GROUP BY invoice_Id  ORDER BY invoice_Id ASC"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2350286215.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_16 = pd.read_sql_query("SELECT invoice_Id AS id_facture, sum(quantity) AS nombre_article FROM Invoice_Line GROUP BY invoice_Id  ORDER BY invoice_Id ASC"

In [701]:
df_16

     id_facture  nombre_article
0             1               2
1             2               4
2             3               6
3             4               9
4             5              14
..          ...             ...
407         408               4
408         409               6
409         410               9
410         411              14
411         412               1

[412 rows x 2 columns]

In [703]:
df_16.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412 entries, 0 to 411
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_facture      412 non-null    int64
 1   nombre_article  412 non-null    int64
dtypes: int64(2)
memory usage: 6.6 KB

17. **Ventes par agent de vente** : Fournissez une requête affichant les
 ventes totales réalisées par chaque agent de vente.

In [706]:
df_17 = pd.read_sql_query("SELECT e.first_name || ' ' || e.last_name AS NomCompletagent, SUM(i.total) AS total_vente, COUNT(i.invoice_Id) AS nombre_vente FROM Invoice i JOIN Customer c ON i.customer_Id=c.customer_id JOIN Employee e ON c.support_rep_Id=e.employee_Id WHERE e.title LIKE '%Sales%Agent%' GROUP BY NomCompletagent"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2394777007.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_17 = pd.read_sql_query("SELECT e.first_name || ' ' || e.last_name AS NomCompletagent, SUM(i.total) AS total_vente, COUNT(i.invoice_Id) AS nombre_vente FROM Invoice i JOIN Customer c ON i.customer_Id=c.customer_id JOIN Employee e ON c.support_rep_Id=e.employee_Id WHERE e.title LIKE '%Sales%Agent%' GROUP BY NomCompletagent"

In [708]:
df_17

  nomcompletagent  total_vente  nombre_vente
0    Jane Peacock       833.04           146
1   Margaret Park       775.40           140
2   Steve Johnson       720.16           126

 18. **Meilleur agent de 2009** : Quel agent de vente a réalisé le plus de
 ventes en 2009 ?

Avec les résultats obtenus 8 il ya eu 0 vente en 2009

 19. **Meilleur agent de 2010** : Quel agent de vente a réalisé le plus de
 ventes en 2010 ?

Idem

 20. **Meilleur agent global** : Quel agent de vente a réalisé le plus de
 ventes en tout ?

L'agent de vente ayant réalisé le plus de vente est **Jane Peacock**

## Analyse des clients et des pays

21. **Clients par agent de vente** : Fournissez une requête affichant le
 nombre de clients attribués à chaque agent de vente.

In [718]:
df_21 = pd.read_sql_query("SELECT e.first_name || ' ' || e.last_name AS NomCompletagent, COUNT(c.customer_Id) AS nombre_client FROM Customer c JOIN Employee e ON c.support_rep_Id=e.employee_Id WHERE e.title LIKE '%Sales%Agent%' GROUP BY NomCompletagent"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\1319999409.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_21 = pd.read_sql_query("SELECT e.first_name || ' ' || e.last_name AS NomCompletagent, COUNT(c.customer_Id) AS nombre_client FROM Customer c JOIN Employee e ON c.support_rep_Id=e.employee_Id WHERE e.title LIKE '%Sales%Agent%' GROUP BY NomCompletagent"

In [720]:
df_21

  nomcompletagent  nombre_client
0    Jane Peacock             21
1   Margaret Park             20
2   Steve Johnson             18

22. **Ventes totales par pays** : Fournissez une requête affichant les
 ventes totales par pays.
 Quel pays a dépensé le plus ?

In [723]:
df_22 = pd.read_sql_query("SELECT billing_country AS pays, SUM(total) AS total_vente FROM Invoice GROUP BY pays"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2625006740.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_22 = pd.read_sql_query("SELECT billing_country AS pays, SUM(total) AS total_vente FROM Invoice GROUP BY pays"

In [725]:
df_22

              pays  total_vente
0        Argentina        37.62
1            Spain        37.62
2            Italy        37.62
3          Hungary        45.62
4            India        75.26
5   Czech Republic        90.24
6          Belgium        37.62
7           Sweden        38.62
8            Chile        46.62
9           Norway        39.62
10          France       195.10
11             USA       523.06
12  United Kingdom       112.86
13     Netherlands        40.62
14          Brazil       190.10
15         Austria        42.62
16          Poland        37.62
17       Australia        37.62
18         Ireland        45.62
19         Germany       156.48
20         Denmark        37.62
21          Canada       303.96
22         Finland        41.62
23        Portugal        77.24

##  Analyse des morceaux et des artistes

 23. **Morceau le plus acheté en 2023** : Fournissez une requête
 affichant le morceau le plus acheté en 2013.

In [729]:
 df_23 = pd.read_sql_query("SELECT t.name AS nom_morceau, COUNT(il.quantity) AS nombre_achete FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id JOIN Invoice i ON il.invoice_Id = i.invoice_Id WHERE DATE_PART('year', I.invoice_date)=2023 GROUP BY nom_morceau ORDER BY nombre_achete DESC LIMIT 1"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\3563137779.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_23 = pd.read_sql_query("SELECT t.name AS nom_morceau, COUNT(il.quantity) AS nombre_achete FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id JOIN Invoice i ON il.invoice_Id = i.invoice_Id WHERE DATE_PART('year', I.invoice_date)=2023 GROUP BY nom_morceau ORDER BY nombre_achete DESC LIMIT 1"

In [731]:
df_23

         nom_morceau  nombre_achete
0  All I Want Is You              2

24. **Top 5 des morceaux les plus achetés** : Fournissez une requête
 affichant les 5 morceaux les plus achetés en tout.

In [734]:
df_24 = pd.read_sql_query("SELECT t.name AS nom_morceau, COUNT(il.quantity) AS nombre_achete FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id GROUP BY nom_morceau ORDER BY nombre_achete DESC LIMIT 5"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\1673983997.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_24 = pd.read_sql_query("SELECT t.name AS nom_morceau, COUNT(il.quantity) AS nombre_achete FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id GROUP BY nom_morceau ORDER BY nombre_achete DESC LIMIT 5"

In [736]:
df_24

               nom_morceau  nombre_achete
0              The Trooper              5
1     Hallowed Be Thy Name              4
2                 Eruption              4
3      Sure Know Something              4
4  The Number Of The Beast              4

 25. **Top 3 des artistes les plus vendus** : Fournissez une requête
 affichant les 3 artistes les plus vendus.

In [739]:
df_25 = pd.read_sql_query("SELECT a.name AS nom_artist, COUNT(il.quantity) AS nombre_vendu FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id JOIN Album al ON t.album_Id = al.album_Id JOIN Artist a ON al.artist_Id = a.artist_Id GROUP BY nom_artist ORDER BY nombre_vendu DESC LIMIT 3"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\3798871210.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_25 = pd.read_sql_query("SELECT a.name AS nom_artist, COUNT(il.quantity) AS nombre_vendu FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id JOIN Album al ON t.album_Id = al.album_Id JOIN Artist a ON al.artist_Id = a.artist_Id GROUP BY nom_artist ORDER BY nombre_vendu DESC LIMIT 3"

In [741]:
df_25

    nom_artist  nombre_vendu
0  Iron Maiden           140
1           U2           107
2    Metallica            91

26. **Type de média le plus acheté** : Fournissez une requête affichant
 le type de média le plus acheté.

In [744]:
df_26 = pd.read_sql_query("SELECT mt.name AS nom_media, COUNT(il.quantity) AS nombre_vendu FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id JOIN Media_Type mt ON t.media_type_Id = mt.media_type_Id GROUP BY nom_media ORDER BY nombre_vendu DESC LIMIT 1"
                         , conexion)

C:\Users\mabou\AppData\Local\Temp\ipykernel_19944\2916216487.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_26 = pd.read_sql_query("SELECT mt.name AS nom_media, COUNT(il.quantity) AS nombre_vendu FROM Invoice_Line il JOIN Track t ON il.track_Id = t.track_Id JOIN Media_Type mt ON t.media_type_Id = mt.media_type_Id GROUP BY nom_media ORDER BY nombre_vendu DESC LIMIT 1"

In [746]:
df_26

         nom_media  nombre_vendu
0  MPEG audio file          1976

## Déconnexion à la base de données

In [749]:
conexion.close()